OdBrepBuilder.setTransformation(OdGeMatrix3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets transformation matrix for BrepBuilder.
\param transformation [in] The transformation matrix.
\returns eOk if the operation is successful; eNotApplicable if this function
is not supported by the current implementation; eInvalidInput if the matrix is invalid.

OdBrepBuilder.setBBSettings(System.UInt32!System.Runtime.CompilerServices.IsLong,System.Boolean)
\details
Sets settings for BrepBuilder.
\param flag [in] Bit flag from the BrepBuilderSettings enumeration.
\param enable [in] True to enable/set the flag, false to disable/remove the flag.

OdBrepBuilder.getBBSettings
\details
Returns flags (settings) of the BrepBuilder.
\returns Flags (settings) of the BrepBuilder.

OdBrepBuilder.isValid
\details
Checks the state of the product-dependent implementation.
\returns True if the product-dependent implementation isn't NULL.

OdBrepBuilder.getValidationErrors
\details
Returns errors found during validation.
\returns Pointer to the ValidationErrors object that stores errors
encountered during the validation process.

OdBrepBuilder.enableValidator(System.Boolean)
\details
Enables or disables validation in BRepBuilder.
\param bEnable [in] True to enable validation; false to disable validation.

OdBrepBuilder.setTag(System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Sets the tag value that is used for faces and edges.
Use setTag() just after addFace(), addEdge() or addVertex() calls.
\param id  [in] B-Rep builder entity ID.
\param tag [in] Tag value.
\remarks
setTag() should be used for either all or none topologies of the same type.

OdBrepBuilder.finish
\details
Completes construction of the geometry. The geometry is validated and if
valid, stored in this Builder.
\returns Pointer to the built entity, that is specific for each
product-dependent implementation.
\remarks
finish() throws an exception on construction fail or validation fail.

OdBrepBuilder.setFaceColor(System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdCmEntityColor!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets the face color.
\param faceId    [in] Face ID.
\param faceColor [in] Face color.
\returns eOk if the operation is successful; eNotApplicable if this function
is not supported by the current implementation or the face color is part of
the material.

OdBrepBuilder.setEdgeColor(System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdCmEntityColor!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets the edge color.
\param edgeId    [in] Edge ID.
\param edgeColor [in] Edge color.
\returns eOk if the operation is successful; eNotApplicable if this function
is not supported by the current implementation; eInvalidInput if the color
method is not supported by the current implementation.

OdBrepBuilder.setFaceMaterialMapping(System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGiMapper!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets the material mapper for the face.
\param faceId         [in] Face ID.
\param materialMapper [in] Material mapper.
\returns eOk if the operation is successful; eNotApplicable if it is not
supported by the current implementation or the material mapping is part of
the material.

OdBrepBuilder.setFacesMaterial(System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdDbStub*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets the material ID to the specified face.
\param faceId     [in] Face ID.
\param materialId [in] Material ID.
\returns eOk if the operation is successful; eNotApplicable if it is not

OdBrepBuilder.setFlag(System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.UInt32!System.Runtime.CompilerServices.IsLong,System.Boolean)
\details
Sets a specified bit flag on an object.
\param id     [in] Entity ID.
\param flag   [in] Bit flag from the BrEntityFlags enumeration.
\param enable [in] True to enable/set the flag, false to disable/remove the flag.
\sa
BrEntityFlags enumeration.

OdBrepBuilder.setAllowShortEdges
\details
Makes BRepBuilder allow edges that it would normally disallow as being too
short for geometry.
\remarks
Currently not implemented.

OdBrepBuilder.removedSomeFaces
\details
This function removes  some problematic faces from the output geometry.
\returns True if BRepBuilder removed some problematic faces, false if not.
\remarks
If allowRemovalOfProblematicFaces() was not called to enable removal of
problematic faces, this function will return 'false'. Note that if some
faces were removed, the output geometry's type will be OpenShell regardless
of the expected type that was specified when the BRepBuilder was created.
Currently not implemented.

OdBrepBuilder.isValidLoopId(System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
A validator function that checks whether the loop ID corresponds to the loop
previously added to this BRepBuilder object.
\param loopId [in] Loop ID.
\returns True if the loop with the specified ID has been already added;
false otherwise.

OdBrepBuilder.isValidFaceId(System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
A validator function that checks whether the face ID corresponds to the face
previously added to this BRepBuilder object.
\param faceId [in] Face ID.
\returns True if the face with the specified ID has been already added;
false otherwise.

OdBrepBuilder.isValidShellId(System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
A validator function that checks whether the shell ID corresponds to the
shell previously added to this BRepBuilder object.
\param shellId [in] Shell ID.
\returns True if the shell with the specified ID has been already added;
false otherwise.

OdBrepBuilder.isValidComplexId(System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
A validator function that checks whether the complex ID corresponds to the
complex previously added to this BRepBuilder object.
\param complexId [in] Complex ID.
\returns True if the complex with the specified ID has been already added;
false otherwise.

OdBrepBuilder.isValidEdgeId(System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
A validator function that checks whether the edge ID corresponds to the edge
previously added to this BRepBuilder object.
\param edgeId [in] Edge ID.
\returns True if the edge with the specified ID has been already added;
false otherwise.

OdBrepBuilder.isResultAvailable
\details
A validator function that checks the state of this BRepBuilder object.
\returns True if this BRepBuilder object has successfully built a B-Rep;
false otherwise.
\remarks
Currently not implemented.

OdBrepBuilder.isPermittedSurfaceType(OdGeSurface!System.Runtime.CompilerServices.IsConst*)
\details
A validator function that checks whether the surface object is of the type
that is supported as a face surface by BRepBuilder.
\param pSurf [in] Pointer to the surface object.
\returns True if the product-dependent implementation of the B-Rep builder
can use this surface; false otherwise.
\remarks
Not implemented by default, but the product-dependent implementation of the
B-Rep builder can have their own implemetnations of this method.

OdBrepBuilder.getResult
\details
Gets the geometry object built by this BRepBuilder. This method clears the
built geometry stored in the BRepBuilder.
This function will throw an error if this BRepBuilderGeometryId hasn't
completed building the B-Rep. Use IsResultAvailable() to verify whether this
BRepBuilder contains a valid result.
Built entity is specific for each product-dependent implementation.
\returns Pointer to the built geometry object.
\remarks
Currently not implemented.

OdBrepBuilder.finishLoop(System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Indicates that the caller has finished defining the given loop.
\param loopId [in] Loop ID.

OdBrepBuilder.finishFace(System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Indicates that the caller has finished defining the given face.
\param faceId [in] Face ID.

OdBrepBuilder.finishShell(System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Indicates that the caller has finished defining the given shell.
\param shellId [in] Shell ID.

OdBrepBuilder.finishComplex(System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Indicates that the caller has finished defining the given complex.
\param complexId [in] Complex ID.

OdBrepBuilder.canAddGeometry
\details
A validator function that checks the state of this BRepBuilder object.
\returns True if this BRepBuilder object is accepting B-Rep data, false
otherwise.
\remarks
Currently not implemented.

OdBrepBuilder.allowRemovalOfProblematicFaces
\details
Allows BRepBuilder to remove problematic faces (e.g. due to inaccurate edge
geometry). If this option is enabled and BRepBuilder removes some faces, the
output geometry's type will be OpenShell regardless of the expected type,
specified when the BRepBuilder was created.
\remarks
Currently not implemented.

OdBrepBuilder.addShell(System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates an empty shell.
\param complexId [in] Complex ID.
\returns BRepBuilderGeometryId of the added face.

OdBrepBuilder.addLoop(System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates an empty loop in a given face of the geometry being built.
\param faceId [in] Face ID.
\returns BRepBuilderGeometryId of the added face.

OdBrepBuilder.addFace(OdGeSurface!System.Runtime.CompilerServices.IsConst*,OdBrepBuilder.EntityDirection,System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates an empty face in the geometry being built.
\param pSurf         [in] Pointer to the underlying surface.
\param faceDirection [in] Face's orientation in relation to the underlying surface.
\param shellId       [in] Shell ID.
\returns BRepBuilderGeometryId of the added face.

OdBrepBuilder.addVertex(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Adds a new vertex to the geometry being built.
\param point [in] 3D point.
\returns BRepBuilderGeometryId of the added vertex.

OdBrepBuilder.addEdge(OdGeCurve3d!System.Runtime.CompilerServices.IsConst*,System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Adds a new edge to the geometry being built.
\param pCurveForEdge [in] Pointer to the edge geometry (object-space curve).
\param vertex1Id     [in] ID of the first vertex.
\param vertex2Id     [in] ID of the second vertex.
\returns BRepBuilderGeometryId of the added edge.

OdBrepBuilder.addEdge(OdGeCurve3d!System.Runtime.CompilerServices.IsConst*)
\details
Adds a new edge to the geometry being built.
\param pCurveForEdge [in] Pointer to the edge geometry (object-space curve).
\returns BRepBuilderGeometryId of the added edge.

OdBrepBuilder.addCoedge(System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdBrepBuilder.EntityDirection,OdGeCurve2d!System.Runtime.CompilerServices.IsConst*)
\details
Adds a coedge associated to a previously added edge.
A coedge represents the use of an edge on one of the edge's faces.
\param loopId         [in] ID of the loop which the added code belongs to.
\param edgeId         [in] ID of the edge.
\param codgeDirection [in] Coedge direction in relation to the edge.
\param pParCur        [in] Pointer to a paramectic curve. Optional parameter.
\returns BRepBuilderGeometryId of the added coedge.
\remarks
OdError(eInvalidInput) exception is thrown if the type of the parametric
curve (pParCur) is not supported by the BrepBuilder implementation.

OdBrepBuilder.set(System.Void!System.Runtime.CompilerServices.IsConst*)
\details
Sets the product-dependent implementation.
\param pFile [in] Pointer to the product-dependent implementation.

OdBrepBuilder.getType
\details
Returns the type of the output geometry.
\returns Type of the output geometry.

OdBrepBuilder.Dispose
\details
Destructor. Destroys the OdBrepBuilder object.

OdBrepBuilder.#ctor
\details
Creates a new instance of the OdBrepBuilder object with default parameters.

OdBrepBuilder.kDefaultVertexId
Default Vertex ID.

OdBrepBuilder.kDefaultShellId
Default Shell ID.